
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	УсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура УсловноеОформление()
   	ОбщегоНазначенияКлиентСервер.ПолучитьОбъект(УсловноеОформление.Элементы, ЭтотОбъект.ИмяФормы, Элементы.Список.ПодчиненныеЭлементы);		
КонецПроцедуры	

//&НаСервере
//Процедура ЗаполнитьОшибки()

//	Для каждого Док из Список Цикл
//		
//		Если Док.РезультатЛечения = Перечисления.РезультатЛечения.ЛечениеНеЗакончено Тогда
//			Док.ЕстьОшибка = 0;
//		ИначеЕсли Док.РезультатЛечения = Перечисления.РезультатЛечения.Неэффективное Тогда
//			Док.ЕстьОшибка = 1;
//		Иначе  
//			Док.ЕстьОшибка = 2;
//		КонецЕсли;
//		
//	КонецЦикла;	
//	
//КонецПроцедуры	