
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)  
	
	Объект.Наименование = Объект.ПолноеИмя; 
	
КонецПроцедуры      

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользователь.Имя = Объект.ПолноеИмя;
	НовыйПользователь.ПолноеИмя = Объект.ПолноеИмя;
	НовыйПользователь.Пароль = Объект.Пароль;
	НовыйПользователь.ПоказыватьВСпискеВыбора = Истина;
	НовыйПользователь.Записать();  
	
	Объект.ИдентификаторПользователяИБ = НовыйПользователь.УникальныйИдентификатор; 
	/// еще что-то
КонецПроцедуры  


       