
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)  
	
	Объект.Наименование = Объект.ПолноеИмя; 
	
КонецПроцедуры      

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.ИдентификаторПользователяИБ) Тогда
		СуществующийПользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
		Если СуществующийПользователь = Неопределено Тогда
			// Как так, Ид есть а пользователя нет
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Как так, Ид есть а пользователя нет. Проверить Ид " + Объект.ИдентификаторПользователяИБ;
			СообщениеПользователю.Сообщить();
		Иначе
			СуществующийПользователь.Имя = Объект.ПолноеИмя;
			СуществующийПользователь.ПолноеИмя = Объект.ПолноеИмя;
			СуществующийПользователь.Пароль = Объект.Пароль;
			СуществующийПользователь.Записать();  
		КонецЕсли;
		
	Иначе
		// Создание нового
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.Имя = Объект.ПолноеИмя;
		НовыйПользователь.ПолноеИмя = Объект.ПолноеИмя;
		НовыйПользователь.Пароль = Объект.Пароль;
		НовыйПользователь.ПоказыватьВСпискеВыбора = Истина;
		НовыйПользователь.Записать();  
		
		ТекущийОбъект.ИдентификаторПользователяИБ = НовыйПользователь.УникальныйИдентификатор;  
		//Записать();
	КонецЕсли;
КонецПроцедуры


       