//&НаСервере 
//Перем СтрокаВыбор;

&НаКлиенте
Процедура СхемыЛеченийВыборПриИзменении(Элемент)
	
	//Возможность выбора только одной схемы в ТЧ
	ТекНомерСтр = Элементы.СхемыЛечений.ТекущиеДанные.НомерСтроки;
	Для каждого Строка из Объект.СхемыЛечений Цикл
		Если Строка.НомерСтроки <> ТекНомерСтр Тогда
			Строка.Выбор = ЛОЖЬ;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСхемыЛечения(Команда)
	
	Объект.СхемыЛечений.Очистить(); 
	Объект.СписокПрепаратовСПротивопоказаниями.Очистить();
	ПолучитьСхемыЛечения();	
	Объект.СхемыЛечений.Сортировать("КатегорияЭффективности Убыв");
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСхемыЛечения() 
	
	
	МассивДиагнозы = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Диагноз) Тогда 
		МассивДиагнозы.Добавить(Объект.Диагноз);
	Иначе
		
		// симптомы
		Если СписокИспользуемыхСимптомов.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Необходимы данные либо диагноза, либо симптомов!"; 
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;	              
		
		ЗапросДиагнозы = Новый Запрос;
		ЗапросДиагнозы.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДиагнозыСимптомы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Диагнозы.Симптомы КАК ДиагнозыСимптомы
		|ГДЕ
		|	ДиагнозыСимптомы.Симптом В (&СписокСимптомов)";  
		
		ЗапросДиагнозы.УстановитьПараметр("СписокСимптомов", СписокИспользуемыхСимптомов);
		МассивДиагнозы = ЗапросДиагнозы.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"); 
		
	КонецЕсли;
	
	ЗапросОсновной = Новый Запрос;
	ЗапросОсновной.Текст =  "ВЫБРАТЬ
	                        |	РезультатЛечения.СхемаЛечения КАК СхемаЛечения,
	                        |	ВЫБОР
	                        |		КОГДА РезультатЛечения.Эффективное = ЗНАЧЕНИЕ(Перечисление.РезультатЛечения.Эффективное)
	                        |			ТОГДА 1
	                        |		ИНАЧЕ 0
	                        |	КОНЕЦ КАК УспешныеПопытки,
	                        |	1 КАК ОбщееКоличествоПопыток
	                        |ПОМЕСТИТЬ ВТ_Схемы
	                        |ИЗ
	                        |	РегистрСведений.РезультатЛечения КАК РезультатЛечения
	                        |ГДЕ
	                        |	РезультатЛечения.Диагноз В(&МассивДиагнозов)
	                        |;
	                        |
	                        |////////////////////////////////////////////////////////////////////////////////
	                        |ВЫБРАТЬ
	                        |	ВТ_Схемы.СхемаЛечения КАК СхемаЛечения,
	                        |	СУММА(ВТ_Схемы.УспешныеПопытки) КАК УспешныеПопытки,
	                        |	СУММА(ВТ_Схемы.ОбщееКоличествоПопыток) КАК ОбщееКоличествоПопыток
	                        |ПОМЕСТИТЬ ВТ_СхемыСгруппированные
	                        |ИЗ
	                        |	ВТ_Схемы КАК ВТ_Схемы
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	ВТ_Схемы.СхемаЛечения
	                        |;
	                        |
	                        |////////////////////////////////////////////////////////////////////////////////
	                        |ВЫБРАТЬ
	                        |	ВТ_СхемыСгруппированные.СхемаЛечения КАК СхемаЛечения,
	                        |	ВЫБОР
	                        |		КОГДА ВТ_СхемыСгруппированные.ОбщееКоличествоПопыток = 0
	                        |			ТОГДА 0
	                        |		ИНАЧЕ ВТ_СхемыСгруппированные.УспешныеПопытки / ВТ_СхемыСгруппированные.ОбщееКоличествоПопыток * 100
	                        |	КОНЕЦ КАК Коэффициент
	                        |ПОМЕСТИТЬ ВТ_СхемыСКоэфф
	                        |ИЗ
	                        |	ВТ_СхемыСгруппированные КАК ВТ_СхемыСгруппированные
	                        |;
	                        |
	                        |////////////////////////////////////////////////////////////////////////////////
	                        |ВЫБРАТЬ
	                        |	СхемаЛечения2.Диагноз КАК Диагноз,
	                        |	СхемаЛечения2.Ссылка КАК Схема,
	                        |	ЕСТЬNULL(ВТ_СхемыСКоэфф.Коэффициент, 0) КАК КатегорияЭффективности
	                        |ПОМЕСТИТЬ ВТ_СписокСхем
	                        |ИЗ
	                        |	Справочник.СхемаЛечения КАК СхемаЛечения2
	                        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СхемыСКоэфф КАК ВТ_СхемыСКоэфф
	                        |		ПО СхемаЛечения2.Ссылка = ВТ_СхемыСКоэфф.СхемаЛечения
	                        |ГДЕ
	                        |	СхемаЛечения2.Диагноз В(&МассивДиагнозов)
	                        |;
	                        |
	                        |////////////////////////////////////////////////////////////////////////////////
	                        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                        |	СхемаЛеченияСписокПрепаратов.Препарат КАК Препарат,
	                        |	СхемаЛеченияСписокПрепаратов.Ссылка КАК Ссылка
	                        |ПОМЕСТИТЬ ВТ_СписокПрепаратовВоВсехСхемах
	                        |ИЗ
	                        |	ВТ_СписокСхем КАК ВТ_СписокСхем
	                        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СхемаЛечения.СписокПрепаратов КАК СхемаЛеченияСписокПрепаратов
	                        |		ПО ВТ_СписокСхем.Схема = СхемаЛеченияСписокПрепаратов.Ссылка
	                        |;
	                        |
	                        |////////////////////////////////////////////////////////////////////////////////
	                        |ВЫБРАТЬ
	                        |	ПрепаратыПротивопоказания.Противопоказание КАК Противопоказание,
	                        |	ВТ_СписокПрепаратовВоВсехСхемах.Ссылка КАК Схема,
	                        |	ВТ_СписокПрепаратовВоВсехСхемах.Препарат КАК Препарат
	                        |ИЗ
	                        |	ВТ_СписокПрепаратовВоВсехСхемах КАК ВТ_СписокПрепаратовВоВсехСхемах
	                        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Препараты.Противопоказания КАК ПрепаратыПротивопоказания
	                        |		ПО ВТ_СписокПрепаратовВоВсехСхемах.Препарат = ПрепаратыПротивопоказания.Ссылка
	                        |ГДЕ
	                        |	ПрепаратыПротивопоказания.Противопоказание В(&МассивПротивопоказаний)
	                        |;
	                        |
	                        |////////////////////////////////////////////////////////////////////////////////
	                        |ВЫБРАТЬ
	                        |	МАКСИМУМ(ПрепаратыПротивопоказания.Противопоказание) КАК Противопоказание,
	                        |	ВТ_СписокПрепаратовВоВсехСхемах.Ссылка КАК Схема
	                        |ПОМЕСТИТЬ ВТ_СхемыСПротивопоказаниями
	                        |ИЗ
	                        |	ВТ_СписокПрепаратовВоВсехСхемах КАК ВТ_СписокПрепаратовВоВсехСхемах
	                        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Препараты.Противопоказания КАК ПрепаратыПротивопоказания
	                        |		ПО ВТ_СписокПрепаратовВоВсехСхемах.Препарат = ПрепаратыПротивопоказания.Ссылка
	                        |ГДЕ
	                        |	ПрепаратыПротивопоказания.Противопоказание В(&МассивПротивопоказаний)
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	ВТ_СписокПрепаратовВоВсехСхемах.Ссылка
	                        |;
	                        |
	                        |////////////////////////////////////////////////////////////////////////////////
	                        |ВЫБРАТЬ
	                        |	ВТ_СписокСхем.Диагноз КАК Диагноз,
	                        |	ВТ_СписокСхем.Схема КАК Схема,
	                        |	ВТ_СписокСхем.КатегорияЭффективности КАК КатегорияЭффективности,
	                        |	ВЫБОР
	                        |		КОГДА ВТ_СхемыСПротивопоказаниями.Противопоказание ЕСТЬ NULL
	                        |			ТОГДА ЛОЖЬ
	                        |		ИНАЧЕ ИСТИНА
	                        |	КОНЕЦ КАК ЕстьПротивопоказания
	                        |ПОМЕСТИТЬ ВТ_Итог
	                        |ИЗ
	                        |	ВТ_СхемыСПротивопоказаниями КАК ВТ_СхемыСПротивопоказаниями
	                        |		ПРАВОЕ СОЕДИНЕНИЕ ВТ_СписокСхем КАК ВТ_СписокСхем
	                        |		ПО (ВТ_СписокСхем.Схема = ВТ_СхемыСПротивопоказаниями.Схема)
	                        |;
	                        |
	                        |////////////////////////////////////////////////////////////////////////////////
	                        |ВЫБРАТЬ
	                        |	ВТ_Итог.Диагноз КАК Диагноз,
	                        |	ВТ_Итог.Схема КАК Схема,
	                        |	ВЫБОР
	                        |		КОГДА ВТ_Итог.ЕстьПротивопоказания = ИСТИНА
	                        |			ТОГДА 0
	                        |		ИНАЧЕ ВТ_Итог.КатегорияЭффективности
	                        |	КОНЕЦ КАК Поле1,
	                        |	ВТ_Итог.ЕстьПротивопоказания КАК ЕстьПротивопоказания
	                        |ИЗ
	                        |	ВТ_Итог КАК ВТ_Итог"; 
	
	ЗапросОсновной.УстановитьПараметр("МассивДиагнозов",МассивДиагнозы);
	ЗапросОсновной.УстановитьПараметр("МассивПротивопоказаний", СписокИспользуемыхПротивопоказаний);
	Результат = ЗапросОсновной.ВыполнитьПакет(); 
	Выборка = Результат[8].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СхемыЛечений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Выборка = Результат[5].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СписокПрепаратовСПротивопоказаниями.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;

	
КонецПроцедуры	

&НаСервере
Процедура НайтиСхемыЛеченияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РезультатЛечения.СхемаЛечения КАК Схема,
	|	ВЫБОР
	|		КОГДА РезультатЛечения.Эффективное
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КатегорияЭффективности
	|ИЗ
	|	РегистрСведений.РезультатЛечения КАК РезультатЛечения
	|ГДЕ
	|	РезультатЛечения.Диагноз = &Диагноз";
	Запрос.УстановитьПараметр("Диагноз", Объект.Диагноз);
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СхемыЛечений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Функция ПроверкаЗаполнения()
	
	МассивНезаполненныхПолей = Новый Массив;
	СтруктураЗаполнения = ИнициализацияЗаполнения();
	Для каждого Элемент из СтруктураЗаполнения Цикл
		Если НЕ Элемент.Значение Тогда
			МассивНезаполненныхПолей.Добавить(Элемент.Ключ);
		КонецЕсли;	
	КонецЦикла;	
	
	СтруктураЗаполнения.Вставить("Положительный", МассивНезаполненныхПолей.Количество() = 0); 
	Если  НЕ СтруктураЗаполнения.Положительный Тогда
		СтруктураЗаполнения.Вставить("МассивНезаполненныхПолей", МассивНезаполненныхПолей);
	КонецЕсли;
	
	Возврат  СтруктураЗаполнения;
	
КонецФункции

&НаСервере
Функция ИнициализацияЗаполнения() 
	
	Структура = Новый Структура;
	Структура.Вставить("Возраст", Объект.Возраст > 0);
	Структура.Вставить("Диагноз", ЗначениеЗаполнено(Объект.Диагноз));
	Структура.Вставить("Противопоказания", СписокИспользуемыхПротивопоказаний.Количество() > 0);
	Структура.Вставить("Симптомы", СписокИспользуемыхСимптомов.Количество() > 0); 
	
	Возврат Структура; 
	
КонецФункции

&НаСервере
Процедура ВывестиОшибки(МассивНезаполненныхПолей)
	
	ВсеОшибки = "";
	Для каждого Элемент из МассивНезаполненныхПолей Цикл
		ВсеОшибки = ВсеОшибки + Элемент + "; "
	КонецЦикла;	  
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Не заполнены поля " + ВсеОшибки;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСхемуЛеченияПациента(Команда)

	ОткрытьФорму("Документ.СхемаЛеченияКонкретногоПациента.Форма.ФормаДокумента", СтруктураПараметров());
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураПараметров()    
	
	СтрокаВыбора = Объект.СхемыЛечений.НайтиСтроки(Новый Структура("Выбор", Истина))[0];

	Структура = Новый Структура;
	Структура.Вставить("Диагноз",СтрокаВыбора.Диагноз);
	Структура.Вставить("СхемаЛечения", СтрокаВыбора.Схема);
	
	Возврат Структура;
	
КонецФункции	

&НаКлиенте
Процедура СхемыЛеченийПриИзменении(Элемент) 
	
	ДоступностьКнопкиСозданияДокумента(); 
	
КонецПроцедуры

&НаСервере
Процедура ДоступностьКнопкиСозданияДокумента()  
	
	//Элементы.СоздатьСхемуЛеченияПациента.Доступность = Объект.СхемыЛечений.Количество() > 0;
	Если Объект.СхемыЛечений.Количество() > 0 Тогда 
		ДоступностьКнопки = Объект.СхемыЛечений.НайтиСтроки(Новый Структура("Выбор", Истина)).Количество() > 0;
		Если ДоступностьКнопки Тогда
			СтрокаВыбор = Объект.СхемыЛечений.НайтиСтроки(Новый Структура("Выбор", Истина))[0];
		КонецЕсли;	
		//ТабЧасть = Объект.СхемыЛечений;
		Элементы.СоздатьСхемуЛеченияПациента.Доступность =  ДоступностьКнопки;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ВыбраннаяСхема()

	//ТЗСхемыЛечений = Объект.СхемыЛечений.Выгрузить();
	//Возврат ТЗСхемыЛечений.Найти(Истина, "Выбор");
	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	УстановитьУсловноеОформление();
	ДоступностьКнопкиСозданияДокумента();  
	
КонецПроцедуры

&НаКлиенте
Процедура СхемыЛеченийПриАктивизацииСтроки(Элемент)  
	
	УстановитьОтборПротивопоказания(Элемент);	

КонецПроцедуры   

&НаКлиенте
Процедура УстановитьОтборПротивопоказания(Элемент)
	
	Если Объект.СхемыЛечений.Количество() = 0 Тогда 
		Возврат;   
	КонецЕсли;  
	
	ТД = Элемент.ТекущиеДанные;
	Если ТД = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	//Ном = Элемент.ТекущиеДанные.НомерСтроки - 1;
	Если ЗначениеЗаполнено(ТД.Схема) Тогда
		УстановитьОтборПротивопоказанияНаСервере(ТД.Схема);	
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьОтборПротивопоказанияНаСервере(Схема)
	
	Если Объект.СписокПрепаратовСПротивопоказаниями.Количество() = 0 Тогда 
		Возврат;   
	КонецЕсли;  
	
	//Элементы.СписокПрепаратовСПротивопоказаниями.ОтборСтрок = Неопределено; 
	ПараметрыОтбора = Новый ФиксированнаяСтруктура("Схема", Схема);
	Элементы.СписокПрепаратовСПротивопоказаниями.ОтборСтрок = ПараметрыОтбора; 
	
КонецПроцедуры	


&НаКлиенте
Процедура СхемыЛеченийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	УстановитьОтборПротивопоказания(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура ПосмотретьПротивопоказания(Команда) 
	
	ТД = Элементы.СхемыЛечений.ТекущиеДанные;
	
	// ПосмотретьПротивопоказанияНаСервере(); 
	УстановитьОтборПротивопоказанияНаСервере(ТД.Схема)
	
КонецПроцедуры


&НаСервере
Функция ПосмотретьПротивопоказанияНаСервере()
	
	//Если Объект.СхемыЛечений.Количество() = 0 Тогда 
	//	Возврат;   
	//КонецЕсли;  
    Возврат Справочники.СхемаЛечения.НайтиПоНаименованию("Схема");
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	МассивИменКолонокДляПодсветки = Новый Массив;
	Для каждого Стр из Элементы.СхемыЛечений.ПодчиненныеЭлементы Цикл
		МассивИменКолонокДляПодсветки.Добавить(Стр.Имя);
	КонецЦикла;  
		
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноКрасноФиолетовый); 
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СхемыЛечений.ЕстьПротивопоказания"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;  
	
	Для каждого Строка из МассивИменКолонокДляПодсветки Цикл
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Строка); 
		ПолеОформления.Использование = Истина;
	КонецЦикла;
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноЗеленый); 
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СхемыЛечений.КатегорияЭффективности"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	Для каждого Строка из МассивИменКолонокДляПодсветки Цикл
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Строка); 
		ПолеОформления.Использование = Истина;
	КонецЦикла;
	
КонецПроцедуры	
