
&НаКлиенте
Процедура ДобавитьАналоги(Команда)
	
	//ОткрытьФорму("Обработка.ВводДанныхВБазу.Форма.ФормаАналогов");
	ОткрытьФорму("Документ.ДобавлениеАналогов.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСхемыЛечения(Команда)
	ОткрытьФорму("Справочник.СхемаЛечения.Форма.ФормаЭлемента");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСозданиюПрепаратаНажатие(Элемент)
	ОткрытьФорму("Справочник.Препараты.Форма.ФормаЭлемента");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСозданиюКомпонентаНажатие(Элемент)
	ОткрытьФорму("Справочник.Компоненты.Форма.ФормаЭлемента");
КонецПроцедуры
