
&НаКлиенте
Процедура СостояниеЗдоровьяПриИзменении(Элемент)
	
	СостояниеЗдоровьяПриИзмененииНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура СостояниеЗдоровьяПриИзмененииНаСервере()
	
	Если ДатаЛеченияДействует() Тогда
		Если Объект.СостояниеЗдоровья = Перечисления.СостояниеЗдоровья.Хорошее ИЛИ
			Объект.СостояниеЗдоровья = Перечисления.СостояниеЗдоровья.БезИзменений Тогда 
			
			//ПоказатьПредупреждение(, "Выбор невозможен"); 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Выбор невозможен";
			Объект.СостояниеЗдоровья = Перечисления.СостояниеЗдоровья.ПустаяСсылка();  
			
		КонецЕсли;
	Иначе 
		Если ТипЗнч(ПереченьНегативныхСостоянийЗдоровья().Найти(Объект.СостояниеЗдоровья)) = Тип("Число")  Тогда
			Элементы.РезультатЛечения.СписокВыбора[1].Пометка = Истина;
		КонецЕсли;	
		УстановитьВидимостьРезультатаЛечения();
	КонецЕсли;   
	
КонецПроцедуры	

&НаСервере
Функция ПереченьНегативныхСостоянийЗдоровья()
	
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.СостояниеЗдоровья.БезИзменений);
	Массив.Добавить(Перечисления.СостояниеЗдоровья.Плохое);
	Массив.Добавить(Перечисления.СостояниеЗдоровья.Критическое);
	
	Возврат Массив;
	
КонецФункции	

&НаСервере
Функция ДатаЛеченияДействует()
	Возврат КонецДня(Объект.Дата) + 86400*Объект.ДлительностьЛечения  > ТекущаяДата();
КонецФункции	

&НаСервере
Процедура УстановитьВидимостьРезультатаЛечения() 
	
	Если ДатаЛеченияДействует() Тогда
		Элементы.РезультатЛечения.Видимость = Истина;
		Объект.РезультатЛечения = Перечисления.РезультатЛечения.ЛечениеНеЗакончено;
	Иначе
		//Элементы.РезультатЛечения.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьРезультатаЛечения();
	УстановитьДоступностьЗаполненияПоСхеме();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументПоСхеме(Команда)
	
	 ЗаполнитьДокументПоСхемеНаСервере();
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьДокументПоСхемеНаСервере() 
	
	Препараты  = Объект.СхемаЛечения.СписокПрепаратов;
	Объект.СписокПрепаратов.Очистить(); 
	РасчетДлительности = 0;
	
	Для каждого Позиция из Препараты Цикл 
		
		НоваяСтрока = Объект.СписокПрепаратов.Добавить();
		НоваяСтрока.Препарат = Позиция.Препарат;
		НоваяСтрока.Описание = Позиция.Описание;
		НоваяСтрока.ДатаНачалаПриема = СуммироватьДату(Объект.Дата, Позиция.СКакогоДня - 1);
		НоваяСтрока.ДатаОкончанияПриема =  СуммироватьДату(НоваяСтрока.ДатаНачалаПриема, Позиция.Длительность - 1);
		РасчетДлительности = Макс(РасчетДлительности, Позиция.СКакогоДня + Позиция.Длительность - 1);
		
	КонецЦикла;	
	
	Объект.ДлительностьЛечения = РасчетДлительности;
	Объект.СписокПрепаратов.Сортировать("ДатаНачалаПриема Возр, ДатаОкончанияПриема  Возр");  
	
КонецПроцедуры	 

&НаСервере
Функция СуммироватьДату(СтартоваяДата, КоличествоДней)  
	
	Возврат СтартоваяДата+ 86400*КоличествоДней;	    
	
КонецФункции	

&НаКлиенте
Процедура СхемаЛеченияПриИзменении(Элемент)
	
	УстановитьДоступностьЗаполненияПоСхеме();
	
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьДоступностьЗаполненияПоСхеме()
	
	СхемаЛеченияВыбрана =  ЗначениеЗаполнено(Объект.СхемаЛечения);
	Элементы.ЗаполнитьДокументПоСхеме.Доступность = СхемаЛеченияВыбрана; 
	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
  	ЗаполнитьЗначенияСвойств(Объект, Параметры);  
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОшибки()
	
	Если Объект.РезультатЛечения = Перечисления.РезультатЛечения.ЛечениеНеЗакончено Тогда
		Объект.ЕстьОшибка = 0;
	ИначеЕсли Объект.РезультатЛечения = Перечисления.РезультатЛечения.Неэффективное Тогда
		Объект.ЕстьОшибка = 1;
	Иначе  
		Объект.ЕстьОшибка = 2;
	КонецЕсли;
	
КонецПроцедуры	


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗаполнитьОшибки();
	
КонецПроцедуры

