
&НаКлиенте
Процедура СостояниеЗдоровьяПриИзменении(Элемент)
	
	Если ДатаЛеченияДействует() Тогда
		Если Объект.СостояниеЗдоровья = ПредопределенноеЗначение("Перечисление.СостояниеЗдоровья.Хорошее") ИЛИ
			Объект.СостояниеЗдоровья = ПредопределенноеЗначение("Перечисление.СостояниеЗдоровья.БезИзменений") Тогда 
			
			ПоказатьПредупреждение(, "Выбор невозможен");
			Объект.СостояниеЗдоровья = ПредопределенноеЗначение("Перечисление.СостояниеЗдоровья.ПустаяСсылка");  
			
		КонецЕсли;
	Иначе 
		Если ТипЗнч(ПереченьНегативныхСостоянийЗдоровья().Найти(Объект.СостояниеЗдоровья)) = Тип("Число")  Тогда
			Элементы.РезультатЛечения.СписокВыбора[1].Пометка = Истина;
		КонецЕсли;	
		УстановитьВидимостьРезультатаЛечения();
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПереченьНегативныхСостоянийЗдоровья()
	
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.СостояниеЗдоровья.БезИзменений);
	Массив.Добавить(Перечисления.СостояниеЗдоровья.Плохое);
	Массив.Добавить(Перечисления.СостояниеЗдоровья.Критическое);
	
	Возврат Массив;
	
КонецФункции	

&НаСервере
Функция ДатаЛеченияДействует()
	Возврат КонецДня(Объект.Дата) + 86400*Объект.ДлительностьЛечения  > ТекущаяДата();
КонецФункции	

&НаСервере
Процедура УстановитьВидимостьРезультатаЛечения() 
	
	Если ДатаЛеченияДействует() Тогда
		Элементы.РезультатЛечения.Видимость = Истина;
		Объект.РезультатЛечения = Перечисления.РезультатЛечения.ЛечениеНеЗакончено;
	Иначе
		//Элементы.РезультатЛечения.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьРезультатаЛечения();
	
КонецПроцедуры
