
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр АналогиПрепаратов
	Движения.АналогиПрепаратов.Записывать = Истина; 
	//СписокАналоговДляЗаписи = ПодготовитьТзДляЗаписи();
	Для Каждого Строка Из СписокАналогов Цикл
		Движение = Движения.АналогиПрепаратов.Добавить();
		Движение.Препарат = Строка.Препарат;
		Движение.Аналог = Строка.Аналог;
		//	Движение.Приоритет = ТекСтрокаСписокПрепаратов.Приоритет;
		//ЗаполнитьЗначенияСвойств(Движение,Строка);
	КонецЦикла; 
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры 
	
Функция ПодготовитьТзДляЗаписи()
	
	//ТЗ_СписокАналогов = СписокАналогов.Выгрузить(); 
	//Для Каждого Строка Из СписокАналогов Цикл
	//	НоваяСтрока = ТЗ_СписокАналогов.Добавить();
	//	НоваяСтрока.Препарат = Строка.Аналог;
	//	НоваяСтрока.Аналог = Строка.Препарат;
	//КонецЦикла;  
	//ТЗ_СписокАналогов.Сортировать("Препарат Возр");
	//
	//Возврат ТЗ_СписокАналогов;
	
КонецФункции	

