
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)    
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Наименование = НаименованиеСхемыЛечения();
	КонецЕсли;	
	    
КонецПроцедуры

&НаСервере
Функция НаименованиеСхемыЛечения() 
	
	ОписаниеСтроки = Новый ОписаниеТипов("Строка");
	СтрокаДиагноз = ОписаниеСтроки.ПривестиЗначение(Объект.Диагноз.Наименование);
	РасчетДлительности = 0;

	 Для каждого Позиция из Объект.СписокПрепаратов Цикл
		 РасчетДлительности = Макс(РасчетДлительности, Позиция.СКакогоДня + Позиция.Длительность - 1); 
	 КонецЦикла;
	 СтрокаДлительность = ОписаниеСтроки.ПривестиЗначение(РасчетДлительности);
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст =  "ВЫБРАТЬ
	                 |	СхемаЛечения.Ссылка КАК Ссылка
	                 |ИЗ
	                 |	Справочник.СхемаЛечения КАК СхемаЛечения
	                 |ГДЕ
	                 |	СхемаЛечения.Диагноз = &Диагноз"; 
	 
	 Запрос.УстановитьПараметр("Диагноз",Объект.Диагноз);
	 КоличествоСхем = Запрос.Выполнить().Выбрать().Количество() + 1;
	 СтрокаКоличествоСхем = ОписаниеСтроки.ПривестиЗначение(КоличествоСхем);
	 
	 ИтоговоеНаименование = "Сх. леч. для д-за " + СтрокаДиагноз + " №" 
	 			+ СтрокаКоличествоСхем +": " + СтрокаДлительность + " дней";
	 
	 Возврат ИтоговоеНаименование;  
	 
КонецФункции	
