
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РезультатЛечения
	Движения.РезультатЛечения.Записывать = Истина;
	Движение = Движения.РезультатЛечения.Добавить();
	Движение.Период = Дата;
	Движение.Пациент = Пациент;
	Движение.Диагноз = Диагноз;
	Движение.СхемаЛечения = СхемаЛечения;
	Движение.Эффективное = РезультатЛечения;
	//Движение.Период = Дата;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если РезультатЛечения = Перечисления.РезультатЛечения.ЛечениеНеЗакончено Тогда
		ЕстьОшибка = 0;
	ИначеЕсли РезультатЛечения = Перечисления.РезультатЛечения.Неэффективное Тогда
		ЕстьОшибка = 1;
	Иначе  
		ЕстьОшибка = 2;
	КонецЕсли;
КонецПроцедуры
